export const astrologyConstellations=[
  {id:'aries',name:'양자리',central:6,outer:25,outerWeight:2,baseCost:30,
   effects:[['치명 추가 공격력',1],['치명 추가 방어력',1],['피해 증가',1],['명중',2],['방어력',4],['공격력',7]],completion:[['치명 방어',5],['극대화 방어',5]]},
  {id:'cancer',name:'게자리',central:7,outer:35,outerWeight:2,baseCost:30,
   effects:[['극대화 추가 공격력',2],['극대화 추가 방어력',2],['방어력 관통',2],['피해 증가',2],['명중',3],['공격력',5],['방어력',8]],completion:[['공격력',5],['방어력',5]]},
  {id:'libra',name:'천칭자리',central:8,outer:40,outerWeight:3,baseCost:50,
   effects:[['기본 공격 명중',2],['스킬 공격 명중',2],['기본 공격 회피',2],['스킬 공격 회피',2],['피해 증가',3],['명중',3],['방어력',5],['공격력',8]],completion:[['명중',7],['방어력 관통',7]]},
  {id:'taurus',name:'황소자리',central:11,outer:45,outerWeight:3,baseCost:50,
   effects:[['치명',2],['치명 방어',2],['극대화',2],['무기 증폭',2],['극대화 방어',2],['막기 관통',2],['막기',3],['피해 증가',3],['명중',3],['공격력',5],['방어력',8]],completion:[['물약 회복량',7],['무기 증폭',7]]},
  {id:'leo',name:'사자자리',central:13,outer:50,outerWeight:6,outerWeights:[6,6,6,6,6,6,6,5,30/7,60/17,3,2,2/3],baseCost:50,lockCost:10,
   effects:[['피해 감소',3],['기본 공격 피해 증가',3],['스킬 공격 피해 증가',3],['막기 피해 증가',3],['일반 몬스터 피해 감소',3],['PvP 명중',3],['피해 감소',4],['막기 피해 감소',4],['치명 추가 공격력',4],['치명',4],['명중',4],['방어력',6],['공격력',9]],completion:[['PvP 피해 증폭(%)',3],['경험치 획득률(%)',3]]},
  {id:'gemini',name:'쌍둥이자리',central:15,outer:60,outerWeight:16,outerWeights:[16,16,16,16,16,16,16,16,16,40/3,80/7,160/17,8,16/3,16/9],baseCost:50,lockCost:10,
   effects:[['치명 추가 방어력',3],['극대화 추가 공격력',3],['극대화 추가 방어력',3],['방어력 관통',3],['PvP 명중',3],['스킬 공격 명중',4],['피해 감소',4],['무기 증폭',4],['치명',4],['치명 방어',4],['극대화',5],['피해 증가',5],['명중',5],['공격력',7],['방어력',10]],completion:[['PvP 피해 저항(%)',3],['이동 속도(%)',3]]},
];
